# running in proof/model/
read_ilang design_prep.il
hierarchy -simcheck
formalff -assume
flatten
setundef -undriven -anyseq
setattr -unset keep
delete -output
opt -full
techmap
opt -fast
memory_map -formal
formalff -clk2ff -ff2anyinit
simplemap
dffunmap
abc -g AND -fast
opt_clean
stat
write_aiger -I -B -zinit -no-startoffset -map design_aiger.aim -ywmap design_aiger.ywa design_aiger.aig
